app/views/venta/show.html.erb

    </tr>
    <% if @venta.detalle.any? %>
---
SELECT  1 AS one FROM `detalles`  WHERE `detalles`.`venta_id` = 1 LIMIT 1
SELECT `detalles`.* FROM `detalles`  WHERE `detalles`.`venta_id` = 1