app/views/preparar/index.html.erb

				$('#hay_ventas_pendientes').show();
			$.each(ventas, function(venta_key, venta){
				html += '<div class="col-md-4 pull-left">'
					html += '<div class="box box-solid ' + colores[i] + '">';
						html += '<div class="box-header">'
						    html += '<h3 class="box-title">Cliente: ' + venta.nombre_cliente + '</h3>'
						html += '</div>'
						html += '<div class="box-body">'
						var index = 0

						detalle = venta.detalle
						$.each( venta.basico, function(basico_key, basico){
								var cantidad = -1
								var estado = -1

								seguir = true
								$.each(detalle, function(key, value){
									if(seguir && value.basico_id == basico.id){
										cantidad = value.cantidad
										estado = value.estado
										seguir = false
										//console.log('salida')
									}
								})

				        		html += '<li>'
			        			if( estado != <%= Venta::PREPARANDO %>){
			        				html += '<p class="texto_gris_claro">'
			        			}
			        			html += cantidad + ' * ' + basico.nombre_producto;
				        		if( estado != <%= Venta::PREPARANDO %>){
				        			html += '</p>'
---
SELECT `detalles`.* FROM `detalles`  WHERE `detalles`.`venta_id` = 1
SELECT `venta`.* FROM `venta`  WHERE `venta`.`estado_venta` IN (1, 2)