app/controllers/basicos_controller.rb

SELECT `basicos`.* FROM `basicos`  WHERE (en_venta = 1)
---
  def index
    @basicos = Basico.all

SELECT `ingredientes`.* FROM `ingredientes` INNER JOIN `detalles_basicos` ON `ingredientes`.`id` = `detalles_basicos`.`ingrediente_id` WHERE `detalles_basicos`.`basico_id` = 33
SELECT  `ingredientes`.* FROM `ingredientes`  WHERE `ingredientes`.`id` = 25 LIMIT 1
INSERT INTO `detalles_basicos` (`basico_id`, `created_at`, `ingrediente_id`, `updated_at`) VALUES (33, '2014-06-30 01:47:56', 25, '2014-06-30 01:47:56')
---
  def update
    respond_to do |format|

        parametros = basico_params
        parametros[:nombre_producto] = parametros[:nombre_producto].strip.downcase

        # ANADIR INGREDIENTES
        ingredientes = Array.new
        if !params[:basico][:ingredientes].nil?
            params[:basico][:ingredientes].each do | ingrediente |
                ingredientes.push(:id => ingrediente['id'], :cantidad => ingrediente['cantidad'])
            end
        end

        i = 0
        @basico.ingredientes = Array.new
        @basico.detalles_basicos = Array.new
        #@compuesto.composicion = Array.new

        ingredientes.each do | ingrediente |
          ingrediente_nuevo = Ingrediente.find(ingrediente[:id])
          @basico.ingredientes.push ingrediente_nuevo

UPDATE `basicos` SET `nombre_producto` = 'hamburguesa grande' WHERE `basicos`.`id` = 33
---
          @basico.errors.add :general, "Debe agregar a lo menos un ingrediente."
        end

      if tiene_ingredientes and @basico.update(parametros)

UPDATE `basicos` SET `en_venta` = 0 WHERE `basicos`.`id` = 9
---
  def destroy
    @basico.en_venta = !@basico.en_venta
    @basico.save

SELECT  `basicos`.* FROM `basicos`  WHERE `basicos`.`id` = 33 LIMIT 1
---
    def set_basico
      @basico = Basico.find(params[:id])