app/controllers/compuestos_controller.rb

SELECT `compuestos`.* FROM `compuestos`
---
  def index
    @compuestos = Compuesto.all