app/controllers/ingredientes_controller.rb

SELECT `ingredientes`.* FROM `ingredientes`
---
  def index
    @ingredientes = Ingrediente.all

INSERT INTO `ingredientes` (`categoria`, `created_at`, `nombre`, `refrigerado`, `stock_actual`, `stock_critico`, `stock_ideal`, `updated_at`) VALUES ('Pan', '2014-06-30 06:40:08', 'aasdas', 0, 45, 50, 150, '2014-06-30 06:40:08')
---
  def create
    @edit = false
    @ingrediente = Ingrediente.new(ingrediente_params)

    respond_to do |format|
      if @ingrediente.save

SELECT  `ingredientes`.* FROM `ingredientes`  WHERE `ingredientes`.`id` = 29 LIMIT 1
---
    def set_ingrediente
      @ingrediente = Ingrediente.find(params[:id])