app/controllers/insumos_controller.rb

SELECT `insumos`.* FROM `insumos`
---
  def index
    @insumos = Insumo.all

INSERT INTO `insumos` (`created_at`, `nombre_insumo`, `tipo_insumo`, `updated_at`) VALUES ('2014-06-30 06:36:27', '', 'Envase', '2014-06-30 06:36:27')
---
  def create
    @insumo = Insumo.new(insumo_params)

    respond_to do |format|
      if @insumo.save

SELECT  `insumos`.* FROM `insumos`  WHERE `insumos`.`id` = 1 LIMIT 1
---
    def set_insumo
      @insumo = Insumo.find(params[:id])