app/controllers/lotes_controller.rb

  def index
    if current_user.rol != User::ADMINISTRADOR
      raise CanCan::AccessDenied
    end
    @lotes = Lote.all
---
SELECT `lotes`.* FROM `lotes`