app/controllers/merma_ingredientes_controller.rb

SELECT `merma_ingredientes`.* FROM `merma_ingredientes`
---
  def index
    @merma_ingredientes = MermaIngrediente.all

INSERT INTO `merma_ingredientes` (`cantidad`, `comentario_merma`, `created_at`, `fecha_merma`, `ingrediente_id`, `updated_at`) VALUES (30, 'Caida accidental', '2014-06-30 05:46:52', '2014-06-30', 2, '2014-06-30 05:46:52')
---
  def create
    @merma_ingrediente = MermaIngrediente.new(merma_ingrediente_params)

    respond_to do |format|
      if @merma_ingrediente.save

DELETE FROM `merma_ingredientes` WHERE `merma_ingredientes`.`id` = 2
---
  def destroy
    @merma_ingrediente.destroy

SELECT  `ingredientes`.* FROM `ingredientes`  WHERE `ingredientes`.`id` = 2 LIMIT 1
SELECT  `merma_ingredientes`.* FROM `merma_ingredientes`  WHERE `merma_ingredientes`.`id` = 2 LIMIT 1
---
    def set_merma_ingrediente
      @merma_ingrediente = MermaIngrediente.find(params[:id])