app/controllers/merma_insumos_controller.rb

SELECT `merma_insumos`.* FROM `merma_insumos`
---
  def index
    @merma_insumos = MermaInsumo.all

INSERT INTO `merma_insumos` (`comentario_merma`, `created_at`, `fecha_merma`, `updated_at`) VALUES ('', '2014-06-30 06:20:19', '2014-06-30', '2014-06-30 06:20:19')
---
  def create
    @merma_insumo = MermaInsumo.new(merma_insumo_params)

    respond_to do |format|
      if @merma_insumo.save

SELECT  `merma_insumos`.* FROM `merma_insumos`  WHERE `merma_insumos`.`id` = 1 LIMIT 1
---
    def set_merma_insumo
      @merma_insumo = MermaInsumo.find(params[:id])