app/controllers/preparar_controller.rb

SELECT `venta`.* FROM `venta`  WHERE `venta`.`estado_venta` IN (1, 2)
---
  def index
    if current_user.rol != User::COCINERO
      raise CanCan::AccessDenied
    end
    @ventas = Venta.all.where(:estado_venta => [Venta::EMITIDA, Venta::PREPARANDO])

SELECT  `venta`.* FROM `venta`  WHERE `venta`.`id` = 1 LIMIT 1
SELECT  `basicos`.* FROM `basicos`  WHERE `basicos`.`id` = 1 LIMIT 1
SELECT  `compuestos`.* FROM `compuestos`  WHERE `compuestos`.`id` = 1 LIMIT 1
SELECT `detalles`.* FROM `detalles`  WHERE `detalles`.`venta_id` = 1
---
  def cambiar_estado
    if current_user.rol != User::COCINERO
      raise CanCan::AccessDenied
    end
  	id_venta = params[:id_venta]
  	tipo_producto = params[:tipo_producto]
  	id_producto = params[:id_producto]

  	venta = Venta.find(id_venta)

  	if tipo_producto == 'basico'
  		producto = venta.basico.find(id_producto)
  	elsif tipo_producto == 'compuesto'
  		producto = venta.compuesto.find(id_producto)
  	end

  	indice = -1
  	i = 0
  	venta.detalle.each do | detalle |

UPDATE `detalles` SET `estado` = 3, `updated_at` = '2014-06-30 07:07:04' WHERE `detalles`.`id` = 1
---

  	if indice != -1
  		venta.detalle[ indice ].estado = Venta::FINALIZADA
  		venta.save