app/controllers/proveedors_controller.rb

  def index
    @proveedors = Proveedor.all
---
SELECT `proveedors`.* FROM `proveedors`

  def create
    @proveedor = Proveedor.new(proveedor_params)

    respond_to do |format|
      if @proveedor.save
---
INSERT INTO `proveedors` (`created_at`, `email_proveedor`, `nombre_proveedor`, `rut_proveedor`, `updated_at`) VALUES ('2014-06-30 09:18:32', '', 'IDEAL', '', '2014-06-30 09:18:32')

  def update
    respond_to do |format|
      if @proveedor.update(proveedor_params)
---
UPDATE `proveedors` SET `email_proveedor` = 'contacto@ideal.cl', `rut_proveedor` = '761234560', `telefono_proveedor` = 123456789, `updated_at` = '2014-06-30 09:22:55' WHERE `proveedors`.`id` = 1

    def set_proveedor
      @proveedor = Proveedor.find(params[:id])
---
SELECT  `proveedors`.* FROM `proveedors`  WHERE `proveedors`.`id` = 1 LIMIT 1