app/controllers/user_controller.rb

  def index
    @users = User.where('id != ?', current_user.id)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1

  def crear
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`apellido_materno`, `apellido_paterno`, `created_at`, `email`, `encrypted_password`, `nombre`, `rol`, `rut`, `telefono`, `updated_at`) VALUES ('Paredes', 'Benussi', '2014-06-30 04:40:47', 'giovanni.benussi@usach.cl', '$2a$10$6DHR29PrIjiWS47utI0Fg.DGVfYL3XtrRWK7aj5XJk1h4hCNq0Ef6', 'Giovanni', 5, '175658173', 94659339, '2014-06-30 04:40:47')