app/controllers/venta_controller.rb

  def index
    @venta = Venta.order(fecha_hora: :desc).where('date(fecha_hora) = ?', Time.now.strftime("%Y-%m-%d"))
---
SELECT `venta`.* FROM `venta`  WHERE (date(fecha_hora) = '2014-06-29')  ORDER BY `venta`.`fecha_hora` DESC

  def new
    @venta = Venta.new
    @venta.numero_de_caja = 1
    @venta.estado_venta = Venta.estados['PREPARANDO']
    @venta.comentario_perdida = ''

    basicos = Basico.where(en_venta: true)
    compuestos = Compuesto.where(en_venta: true)
---
SELECT `basicos`.* FROM `basicos`  WHERE `basicos`.`en_venta` = 1
SELECT `compuestos`.* FROM `compuestos`  WHERE `compuestos`.`en_venta` = 1

    basicos.each do | basico |
        if basico[:tipo] == 'basico'
            if Basico.exists?(:id => basico[:id])
                basico_nuevo = Basico.find(basico[:id])
                @venta.basico.push basico_nuevo
---
SELECT  `basicos`.* FROM `basicos`  WHERE `basicos`.`id` = 57 LIMIT 1
INSERT INTO `venta` (`comentario_perdida`, `created_at`, `estado_venta`, `fecha_hora`, `nombre_cliente`, `numero_de_caja`, `precio_total`, `updated_at`, `vendedor_id`) VALUES ('', '2014-06-30 02:35:32', 2, '2014-06-30 02:35:32', 'Luis', 1, 2690, '2014-06-30 02:35:32', 1)

            end
        elsif basico[:tipo] == 'compuesto'
            if Compuesto.exists?(:id => basico[:id])
                basico_nuevo = Compuesto.find(basico[:id])
---
SELECT  `compuestos`.* FROM `compuestos`  WHERE `compuestos`.`id` = 7 LIMIT 1

        i = i + 1
    end

    basicos = Basico.where(en_venta: true)
    compuestos = Compuesto.where(en_venta: true)
---
SELECT `basicos`.* FROM `basicos`  WHERE `basicos`.`en_venta` = 1
SELECT `compuestos`.* FROM `compuestos`  WHERE `compuestos`.`en_venta` = 1

        @diferencia_basicos = (basicos - @venta.basico ) + (compuestos  - @venta.compuesto)
        #@diferencia_basicos = @venta.basico

        tiene_productos = @venta.basico.any? and @venta.compuesto.any?
---
SELECT  1 AS one FROM `basicos`  WHERE `basicos`.`id` = 57 LIMIT 1
SELECT  1 AS one FROM `compuestos`  WHERE `compuestos`.`id` = 7 LIMIT 1

                    basico = Basico.find(detalle.basico_id)

                    j = 0
                        basico.ingredientes.each do | ingrediente |
                            detalle_basico = DetallesBasico.where(:basico_id => detalle.basico_id, :ingrediente_id => ingrediente.id)
---
SELECT `ingredientes`.* FROM `ingredientes` INNER JOIN `detalles_basicos` ON `ingredientes`.`id` = `detalles_basicos`.`ingrediente_id` WHERE `detalles_basicos`.`basico_id` = 1
SELECT `detalles_basicos`.* FROM `detalles_basicos`  WHERE `detalles_basicos`.`basico_id` IS NULL AND `detalles_basicos`.`ingrediente_id` = 7

                                nueva_cantidad = ingrediente.stock_actual - detalle.cantidad * detalle_basico[0].cantidad
                                ingrediente.stock_actual = nueva_cantidad
                            end
                            ingrediente.save
---
UPDATE `ingredientes` SET `stock_actual` = 29, `updated_at` = '2014-06-30 07:19:20' WHERE `ingredientes`.`id` = 15

  def destroy
    #@venta.destroy
    mensaje = "Ha ocurrido un error al cancelar la venta."
    if @venta.estado_venta != Venta::ENTREGADA
        mensaje = "Venta cancelada correctamente."
        @venta.estado_venta = Venta::CANCELADA
        @venta.save
---
UPDATE `venta` SET `estado_venta` = 0, `updated_at` = '2014-06-30 07:07:17' WHERE `venta`.`id` = 1

    def set_venta
      @venta = Venta.find(params[:id])
---
SELECT  `venta`.* FROM `venta`  WHERE `venta`.`id` = 1 LIMIT 1