app/views/basicos/_form.html.erb

  <!-- Agregar ingredientes -->
  <% diferencia_basicos = Ingrediente.all - @basico.ingredientes %>
---
SELECT `ingredientes`.* FROM `ingredientes` INNER JOIN `detalles_basicos` ON `ingredientes`.`id` = `detalles_basicos`.`ingrediente_id` WHERE `detalles_basicos`.`basico_id` = 12

  <!-- Ingredientes -->
          Cantidad: <%= @basico.ingredientes.count %>
---
SELECT COUNT(*) FROM `ingredientes` INNER JOIN `detalles_basicos` ON `ingredientes`.`id` = `detalles_basicos`.`ingrediente_id` WHERE `detalles_basicos`.`basico_id` = 33

<script type="text/javascript">
    $(function(){
        $('#tabla_basicos').delegate('.eliminar', 'click', function(){
            // Agrego el producto a la lista elegible
            var select = $('#select_basico');
            var valor_seleccionado = $(this).closest('input').val();
            if( select.find('option[value='+ valor_seleccionado +']').length == 0){
                var eliminado        = $(this).closest('tr');
                var eliminado_nombre = eliminado.find('td:nth-child(2)');
                var eliminado_value  = eliminado.find('td:nth-child(1)');
                select.append( new Option(eliminado_nombre.text(),eliminado_value.text()) );
            }

            $(this).closest('tr').remove();
            //$('#agregar').show();
            //$('#select_basico').show();
            $('#div_select_basico').show();
        });
        $('#agregar').on('click', function(){
         var row = '<tr>';
            row += '<td><input type="hidden" name="basico[ingredientes][][id]" value ="'+$('#select_basico').val()+'">' + $('#select_basico').val() + '</td>';
            row += '<td>' + $('#select_basico :selected').text() + '</td>';
---
SELECT  `basicos`.* FROM `basicos`  WHERE `basicos`.`id` = 12 LIMIT 1