app/views/basicos/show.html.erb

SELECT  1 AS one FROM `ingredientes` INNER JOIN `detalles_basicos` ON `ingredientes`.`id` = `detalles_basicos`.`ingrediente_id` WHERE `detalles_basicos`.`basico_id` = 12 LIMIT 1
SELECT `ingredientes`.* FROM `ingredientes` INNER JOIN `detalles_basicos` ON `ingredientes`.`id` = `detalles_basicos`.`ingrediente_id` WHERE `detalles_basicos`.`basico_id` = 12
---
    </tr>
    <% if @basico.ingredientes.any? %>